StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK214.h
    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t PLL_CPU_RDY : 1;           /*!< [1..1] PLL CPU ready                                                      */
      __IM  uint32_t HSE_RDY    : 1;            /*!< [2..2] HSE generator ready                                                */
    } CLOCK_STATUS_b;
  } ;
  
  union {
    __IOM uint32_t PLL_CONTROL;                 /*!< (@ 0x00000004) PLL Control Register                                       */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t PLL_CPU_ON : 1;            /*!< [2..2] PLL CPU Enable                                                     */
      __IOM uint32_t PLL_CPU_PLD : 1;           /*!< [3..3] PLL CPU Restart                                                    */
      __IM  uint32_t            : 4;
      __IOM uint32_t PLL_CPU_MUL : 4;           /*!< [11..8] PLL CPU Mul, [x1 .. x16]                                          */
    } PLL_CONTROL_b;
  } ;
  
  union {
    __IOM uint32_t HS_CONTROL;                  /*!< (@ 0x00000008) HSE Generator Control                                      */
    
    struct {
      __IOM uint32_t HSE_ON     : 1;            /*!< [0..0] HSE Enable                                                         */
      __IOM uint32_t HSE_BYP    : 1;            /*!< [1..1] HSE Bypass Mode                                                    */
    } HS_CONTROL_b;
  } ;
  
  union {
    __IOM uint32_t CPU_CLOCK;                   /*!< (@ 0x0000000C) CPU Clock Control                                          */
    
    struct {
      __IOM uint32_t CPU_C1_SEL : 2;            /*!< [1..0] CPU_C1 mux freq select                                             */
      __IOM uint32_t CPU_C2_SEL : 1;            /*!< [2..2] CPU_C2 mux freq select                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t CPU_C3_SEL : 4;            /*!< [7..4] CPU_C2 mux output freq devider, [/1, /2, /4 .. /256]               */
      __IOM uint32_t HCLK_SEL   : 2;            /*!< [9..8] Select Clock for CPU                                               */
    } CPU_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t PER1_CLOCK;                  /*!< (@ 0x00000010) Peripherials Clock Control1                                */
    
    struct {
      __IOM uint32_t PER1_C1_SEL : 2;           /*!< [1..0] PER1_C1 mux freq select                                            */
      __IOM uint32_t PER1_C2_SEL : 2;           /*!< [3..2] PER1_C2 mux freq select                                            */
      __IOM uint32_t DEBUG_EN   : 1;            /*!< [4..4] Debug clock enable                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIM2_C2_SEL : 2;           /*!< [7..6] TIM2_C2 mux freq select                                            */
      __IOM uint32_t UART1_C2_SEL : 2;          /*!< [9..8] UART1_C2 mux freq select                                           */
      __IOM uint32_t UART2_C2_SEL : 2;          /*!< [11..10] UART2_C2 mux freq select                                         */
      __IOM uint32_t SSP2_C2_SEL : 2;           /*!< [13..12] SSP2_C2 mux freq select                                          */
    } PER1_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t ADC_CLOCK;                   /*!< (@ 0x00000014) ADC Clock Control                                          */
    
    struct {
      __IOM uint32_t ADC_C1_SEL : 2;            /*!< [1..0] ADC_C1 mux freq select                                             */
      __IOM uint32_t ADCIU_C1_SEL : 2;          /*!< [3..2] ADCIU_C1 mux freq select                                           */
      __IOM uint32_t ADC_C3_SEL : 4;            /*!< [7..4] ADC_C1 mux output freq devider, [/1, /2, /4 .. /256]               */
      __IOM uint32_t ADCIU_C3_SEL : 4;          /*!< [11..8] ADCIU_C1 mux output freq devider, [/1, /2, /4 .. /256]            */
      __IOM uint32_t ADCIU_CLK_EN : 1;          /*!< [12..12] ADCIU Clock Enable                                               */
      __IOM uint32_t ADC_CLK_EN : 1;            /*!< [13..13] ADC Clock Enable                                                 */
    } ADC_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CLOCK;                   /*!< (@ 0x00000018) RTC Clock Control                                          */
    
    struct {
      __IOM uint32_t HSE_SEL    : 4;            /*!< [3..0] RTC HSE freq devider, [/1, /2, /4 .. /256]                         */
      __IOM uint32_t HSI_SEL    : 4;            /*!< [7..4] RTC HSI freq devider, [/1, /2, /4 .. /256]                         */
      __IOM uint32_t HSE_RTC_EN : 1;            /*!< [8..8] RTC HSE Clock enable                                               */
      __IOM uint32_t HSI_RTC_EN : 1;            /*!< [9..9] RTC HSI Clock enable                                               */
    } RTC_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t PER2_CLOCK;                  /*!< (@ 0x0000001C) Peripherials Clock Control 2                               */
    
    struct {
      __IOM uint32_t SPI1_CLK_EN : 1;           /*!< [0..0] SPI1 Clock Enable                                                  */
      __IOM uint32_t UART1_CLK_EN : 1;          /*!< [1..1] UART1 Clock Enable                                                 */
      __IOM uint32_t UART2_CLK_EN : 1;          /*!< [2..2] UART2 Clock Enable                                                 */
      __IOM uint32_t EEPROM_CLK_EN : 1;         /*!< [3..3] EEPROM Clock Enable                                                */
      __IOM uint32_t RST_CLK_EN : 1;            /*!< [4..4] RST Clock Enable                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t I2C_CLK_EN : 1;            /*!< [6..6] I2C Clock Enable                                                   */
      __IOM uint32_t LCD_CLK_EN : 1;            /*!< [7..7] LCD Clock Enable                                                   */
      __IOM uint32_t ADC_CLK_EN : 1;            /*!< [8..8] ADC Clock Enable                                                   */
      __IOM uint32_t WWDT_CLK_EN : 1;           /*!< [9..9] WWDT Clock Enable                                                  */
      __IOM uint32_t IWDT_CLK_EN : 1;           /*!< [10..10] IWDT Clock Enable                                                */
      __IOM uint32_t PWR_CLK_EN : 1;            /*!< [11..11] Power Clock Enable                                               */
      __IOM uint32_t BKP_CLK_EN : 1;            /*!< [12..12] Backup Clock Enable                                              */
      __IOM uint32_t ADCIU_CLK_EN : 1;          /*!< [13..13] ADCIU Clock Enable                                               */
      __IOM uint32_t TIMER1_CLK_EN : 1;         /*!< [14..14] TIMER1 Clock Enable                                              */
      __IOM uint32_t TIMER2_CLK_EN : 1;         /*!< [15..15] TIMER2 Clock Enable                                              */
      __IOM uint32_t PORTA_CLK_EN : 1;          /*!< [16..16] GPIO PORT_A Clock Enable                                         */
      __IOM uint32_t PORTB_CLK_EN : 1;          /*!< [17..17] GPIO PORT_B Clock Enable                                         */
      __IOM uint32_t PORTC_CLK_EN : 1;          /*!< [18..18] GPIO PORT_C Clock Enable                                         */
    } PER2_CLOCK_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t TIM_CLOCK;                   /*!< (@ 0x00000024) Timer's Clock Control                                      */
    
