StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK214.h
    struct {
      __IOM uint32_t Pin_0      : 2;            /*!< [1..0] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_1      : 2;            /*!< [3..2] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_2      : 2;            /*!< [5..4] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_3      : 2;            /*!< [7..6] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_4      : 2;            /*!< [9..8] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_5      : 2;            /*!< [11..10] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_6      : 2;            /*!< [13..12] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_7      : 2;            /*!< [15..14] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_8      : 2;            /*!< [17..16] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_9      : 2;            /*!< [19..18] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_10     : 2;            /*!< [21..20] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_11     : 2;            /*!< [23..22] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_12     : 2;            /*!< [25..24] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_13     : 2;            /*!< [27..26] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_14     : 2;            /*!< [29..28] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_15     : 2;            /*!< [31..30] Voltage levels switch rate                                       */
    } PWR_b;
  } ;
  
  union {
    __IOM uint32_t GFEN;                        /*!< (@ 0x0000001C) Input pulses filter                                        */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Filter for pin                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Filter for pin                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Filter for pin                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Filter for pin                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Filter for pin                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Filter for pin                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Filter for pin                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Filter for pin                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Filter for pin                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Filter for pin                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Filter for pin                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Filter for pin                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Filter for pin                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Filter for pin                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Filter for pin                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Filter for pin                                                   */
    } GFEN_b;
  } ;
  
  union {
    __IOM uint32_t SETTX;                       /*!< (@ 0x00000020) Set RXTX by MASK                                           */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Set 1 to pin                                                       */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Set 1 to pin                                                       */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Set 1 to pin                                                       */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Set 1 to pin                                                       */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Set 1 to pin                                                       */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Set 1 to pin                                                       */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Set 1 to pin                                                       */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Set 1 to pin                                                       */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Set 1 to pin                                                       */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Set 1 to pin                                                       */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Set 1 to pin                                                     */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Set 1 to pin                                                     */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Set 1 to pin                                                     */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Set 1 to pin                                                     */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Set 1 to pin                                                     */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Set 1 to pin                                                     */
    } SETTX_b;
  } ;
  
  union {
    __IOM uint32_t CLRTX;                       /*!< (@ 0x00000024) CLR RXTX by MASK                                           */
    
