StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK214.h
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Clear pin to 0                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Clear pin to 0                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Clear pin to 0                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Clear pin to 0                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Clear pin to 0                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Clear pin to 0                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Clear pin to 0                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Clear pin to 0                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Clear pin to 0                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Clear pin to 0                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Clear pin to 0                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Clear pin to 0                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Clear pin to 0                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Clear pin to 0                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Clear pin to 0                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Clear pin to 0                                                   */
    } CLRTX_b;
  } ;
  
  union {
    __IM  uint32_t RDTX;                        /*!< (@ 0x00000028) Value of RXTX in Port mode                                 */
    
    struct {
      __IM  uint32_t Pin_0      : 1;            /*!< [0..0] Pin data value                                                     */
      __IM  uint32_t Pin_1      : 1;            /*!< [1..1] Pin data value                                                     */
      __IM  uint32_t Pin_2      : 1;            /*!< [2..2] Pin data value                                                     */
      __IM  uint32_t Pin_3      : 1;            /*!< [3..3] Pin data value                                                     */
      __IM  uint32_t Pin_4      : 1;            /*!< [4..4] Pin data value                                                     */
      __IM  uint32_t Pin_5      : 1;            /*!< [5..5] Pin data value                                                     */
      __IM  uint32_t Pin_6      : 1;            /*!< [6..6] Pin data value                                                     */
      __IM  uint32_t Pin_7      : 1;            /*!< [7..7] Pin data value                                                     */
      __IM  uint32_t Pin_8      : 1;            /*!< [8..8] Pin data value                                                     */
      __IM  uint32_t Pin_9      : 1;            /*!< [9..9] Pin data value                                                     */
      __IM  uint32_t Pin_10     : 1;            /*!< [10..10] Pin data value                                                   */
      __IM  uint32_t Pin_11     : 1;            /*!< [11..11] Pin data value                                                   */
      __IM  uint32_t Pin_12     : 1;            /*!< [12..12] Pin data value                                                   */
      __IM  uint32_t Pin_13     : 1;            /*!< [13..13] Pin data value                                                   */
      __IM  uint32_t Pin_14     : 1;            /*!< [14..14] Pin data value                                                   */
      __IM  uint32_t Pin_15     : 1;            /*!< [15..15] Pin data value                                                   */
    } RDTX_b;
  } ;
} MDR_PORTA_Type;                               /*!< Size = 44 (0x2c)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define MDR_RST_CLOCK_BASE          0x40020000UL
#define MDR_BKP_BASE                0x40060000UL
#define MDR_PORTA_BASE              0x40080000UL
#define MDR_PORTB_BASE              0x40088000UL
#define MDR_PORTC_BASE              0x40090000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define MDR_RST_CLOCK               ((MDR_RST_CLOCK_Type*)     MDR_RST_CLOCK_BASE)
#define MDR_BKP                     ((MDR_BKP_Type*)           MDR_BKP_BASE)
#define MDR_PORTA                   ((MDR_PORTA_Type*)         MDR_PORTA_BASE)
#define MDR_PORTB                   ((MDR_PORTA_Type*)         MDR_PORTB_BASE)
#define MDR_PORTC                   ((MDR_PORTA_Type*)         MDR_PORTC_BASE)

