StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK214.h
/* ============================================  MDR_BKP REG_0E I_LimEn [15..15]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_0E_I_LimEn                                                    */
  MDR_BKP_0E__Ilim__Disable            = 0,     /*!< Disable : Disabled                                                        */
  MDR_BKP_0E__Ilim__Enable             = 1,     /*!< Enable : Enabled                                                          */
} MDR_BKP_0E__Ilim__Enum;

/* ========================================================  REG_0F  ========================================================= */
/* =============================================  MDR_BKP REG_0F LSE_ON [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0F_LSE_ON                                                     */
  MDR_RTC__LSE_ON__Off                 = 0,     /*!< Off : Disable state                                                       */
  MDR_RTC__LSE_ON__On                  = 1,     /*!< On : Enable state                                                         */
} MDR_RTC__LSE_ON__Enum;

/* =============================================  MDR_BKP REG_0F LSE_BYP [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_REG_0F_LSE_BYP                                                    */
  MDR_RTC__LSE_BYP__Off                = 0,     /*!< Off : Use for external resonator                                          */
  MDR_RTC__LSE_BYP__On                 = 1,     /*!< On : Use for external generator                                           */
} MDR_RTC__LSE_BYP__Enum;

/* =============================================  MDR_BKP REG_0F RTC_SEL [2..3]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_REG_0F_RTC_SEL                                                    */
  MDR_BKP_REG_0F_RTC_SEL_LSI           = 0,     /*!< LSI : RTC use LSI clock                                                   */
  MDR_BKP_REG_0F_RTC_SEL_LSE           = 1,     /*!< LSE : RTC use LSE clock                                                   */
  MDR_BKP_REG_0F_RTC_SEL_HSIRTC        = 2,     /*!< HSIRTC : RTC use HSIRTC clock                                             */
  MDR_BKP_REG_0F_RTC_SEL_HSERTC        = 3,     /*!< HSERTC : RTC use HSERTC clock                                             */
} MDR_BKP_REG_0F_RTC_SEL_Enum;

/* =============================================  MDR_BKP REG_0F RTC_EN [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0F_RTC_EN                                                     */
  MDR_BKP_REG_0F_RTC_EN_Off            = 0,     /*!< Off : Disable state                                                       */
  MDR_BKP_REG_0F_RTC_EN_On             = 1,     /*!< On : Enable state                                                         */
} MDR_BKP_REG_0F_RTC_EN_Enum;

/* ============================================  MDR_BKP REG_0F LSE_RDY [13..13]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_0F_LSE_RDY                                                    */
  MDR_BKP_REG_0F_LSE_RDY_NotReady      = 0,     /*!< NotReady : No frequency or unstable                                       */
  MDR_BKP_REG_0F_LSE_RDY_Ready         = 1,     /*!< Ready : Frequency ready                                                   */
} MDR_BKP_REG_0F_LSE_RDY_Enum;

/* ============================================  MDR_BKP REG_0F LSI_ON [15..15]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_REG_0F_LSI_ON                                                     */
  MDR_BKP_REG_0F_LSI_ON_Off            = 0,     /*!< Off : Disable state                                                       */
  MDR_BKP_REG_0F_LSI_ON_On             = 1,     /*!< On : Enable state                                                         */
} MDR_BKP_REG_0F_LSI_ON_Enum;

/* ===========================================  MDR_BKP REG_0F LSI_TRIM [16..20]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_0F_LSI_TRIM                                                   */
  MDR_BKP_REG_0F_LSI_TRIM_69KHz        = 0,     /*!< 69KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_65KHz        = 1,     /*!< 65KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_60KHz        = 2,     /*!< 60KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_58KHz        = 3,     /*!< 58KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_52KHz        = 4,     /*!< 52KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_50KHz        = 5,     /*!< 50KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_49KHz        = 6,     /*!< 49KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_45KHz        = 7,     /*!< 45KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_44KHz        = 8,     /*!< 44KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_42KHz        = 9,     /*!< 42KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_40KHz        = 10,    /*!< 40KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_39KHz        = 11,    /*!< 39KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_37KHz        = 12,    /*!< 37KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_36KHz        = 13,    /*!< 36KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_35KHz        = 14,    /*!< 35KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_33KHz        = 15,    /*!< 33KHz : LSI frequency tuner                                               */
  MDR_BKP_REG_0F_LSI_TRIM_32KHz        = 16,    /*!< 32KHz : LSI frequency tuner                                               */
} MDR_BKP_REG_0F_LSI_TRIM_Enum;

/* ============================================  MDR_BKP REG_0F LSI_RDY [21..21]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_0F_LSI_RDY                                                    */
  MDR_BKP_REG_0F_LSI_RDY_NotReady      = 0,     /*!< NotReady : No frequency or unstable                                       */
  MDR_BKP_REG_0F_LSI_RDY_Ready         = 1,     /*!< Ready : Frequency ready                                                   */
} MDR_BKP_REG_0F_LSI_RDY_Enum;

