StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK214.h
/* ===========================================  MDR_PORTA PULL Down_Pin_3 [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_3                                                 */
  MDR_PORTA_PULL_Down_Pin_3_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_3_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_3_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_4 [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_4                                                 */
  MDR_PORTA_PULL_Down_Pin_4_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_4_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_4_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_5 [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_5                                                 */
  MDR_PORTA_PULL_Down_Pin_5_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_5_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_5_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_6 [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_6                                                 */
  MDR_PORTA_PULL_Down_Pin_6_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_6_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_6_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_7 [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_7                                                 */
  MDR_PORTA_PULL_Down_Pin_7_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_7_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_7_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_8 [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_8                                                 */
  MDR_PORTA_PULL_Down_Pin_8_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_8_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_8_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_9 [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_9                                                 */
  MDR_PORTA_PULL_Down_Pin_9_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_9_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_9_Enum;

/* ==========================================  MDR_PORTA PULL Down_Pin_10 [10..10]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_10                                                */
  MDR_PORTA_PULL_Down_Pin_10_Off       = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_10_DOWN      = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_10_Enum;

/* ==========================================  MDR_PORTA PULL Down_Pin_11 [11..11]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_11                                                */
  MDR_PORTA_PULL_Down_Pin_11_Off       = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_11_DOWN      = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_11_Enum;

/* ==========================================  MDR_PORTA PULL Down_Pin_12 [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_12                                                */
  MDR_PORTA_PULL_Down_Pin_12_Off       = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_12_DOWN      = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_12_Enum;

/* ==========================================  MDR_PORTA PULL Down_Pin_13 [13..13]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_13                                                */
  MDR_PORTA_PULL_Down_Pin_13_Off       = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_13_DOWN      = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_13_Enum;

/* ==========================================  MDR_PORTA PULL Down_Pin_14 [14..14]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_14                                                */
  MDR_PORTA_PULL_Down_Pin_14_Off       = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_14_DOWN      = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_14_Enum;

/* ==========================================  MDR_PORTA PULL Down_Pin_15 [15..15]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_15                                                */
  MDR_PORTA_PULL_Down_Pin_15_Off       = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_15_DOWN      = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_15_Enum;

/* ============================================  MDR_PORTA PULL UP_Pin_ [16..16]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_UP_Pin_                                                    */
  MDR_PORTA_PULL_UP_Pin__Off           = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_UP_Pin__UP            = 1,     /*!< UP : Pin pulled up to Ucc                                                 */
} MDR_PORTA_PULL_UP_Pin__Enum;

/* ==========================================================  PD  =========================================================== */
/* ===========================================  MDR_PORTA PD Driver_Pin_0 [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_0                                                 */
  MDR_GPIO__PIN_DRIVER__Driver         = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_GPIO__PIN_DRIVER__OpenDrain      = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_GPIO__PIN_DRIVER__Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_1 [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_1                                                 */
  MDR_PORTA_PD_Driver_Pin_1_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_1_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_1_Enum;

